---
kind: type
id: T:Autodesk.Revit.DB.SpecTypeId.Int
source: html/8d28b8ee-90a3-e088-df12-d5eb1f8443d0.htm
---
# Autodesk.Revit.DB.SpecTypeId.Int

This class contains constants identifying integer specs.

## Syntax (C#)
```csharp
public static class Int
```